'''
다음 예시와 같이, 여러 후보자에 대한 투표 결과를 집계하는 프로그램을 작성하시오. 사용자는 먼저 후보자의 수를 입력하고, 그에 맞춰 후보자들의 이름을 입력한다. 이후 투표 횟수와 각 투표 결과를 숫자로 입력받아 최종 결과를 딕셔너리에 저장하여 출력하시오.

지시사항:

1.전체 후보자의 수를 사용자로부터 입력받으시오.
2. for 반복문을 사용하여 후보자 수만큼 후보자들의 이름을 입력받고, candidates 리스트에 저장하시오.
3. 각 후보자의 투표 수를 저장할 딕셔너리(votes)를 생성하고, candidates 리스트의 이름을 키로, 초기 투표 수(0)를 값으로 설정하시오.
4. 전체 투표 횟수를 입력받으시오.
5. for 반복문을 사용하여 투표 횟수만큼 사용자로부터 각 투표 결과를 입력받으시오. 입력은 후보자의 순서 번호(1, 2, 3...)로 받으시오.
6. 입력받은 투표 결과에 따라 해당 후보자의 투표 수를 1씩 증가시키시오.
7. 최종적으로 딕셔너리에 저장된 각 후보자의 투표 수를 출력하시오.

실행 예:

후보자 수를 입력하시오 >>> 3

1번째 후보자의 이름을 입력하시오 >>> 김일
2번째 후보자의 이름을 입력하시오 >>> 김이
3번째 후보자의 이름을 입력하시오 >>> 김삼

전체 투표 횟수를 입력하시오 >>> 5

1번째 투표 (1: 김일, 2: 김이, 3: 김삼) >>> 1
2번째 투표 (1: 김일, 2: 김이, 3: 김삼) >>> 2
3번째 투표 (1: 김일, 2: 김이, 3: 김삼) >>> 1
4번째 투표 (1: 김일, 2: 김이, 3: 김삼) >>> 3
5번째 투표 (1: 김일, 2: 김이, 3: 김삼) >>> 1

--- 투표 결과 ---

김일: 3표
김이: 1표
김삼: 1표
'''
candidates = []
candidate = int(input('후보자 수를 입력하시오 >>> '))

for i in range(candidate):
    candidate_man = input(f'{i+1}번째 후보자 이름을 입력하시오 >>> ')
    candidates.append(candidate_man)

votes = {name: 0 for name in candidates}
vote = int(input('전체 투표 횟수를 입력하시오 >>> '))

for i in range(vote):
    new_vote = int(input(f'{i+1}번째 투표 (' + ", ".join([f'{j+1} : {candidates[j]}' for j in range(candidate)]) + ' )>>> '))
    if new_vote > len(candidates) or new_vote < 1:
        print('오류표')
    else:
        votes[candidates[new_vote-1]] += 1

print('--- 투표 결과 ---')
for key, value in votes.items():
    print(f'{key}: {value}표')